
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Доставка") Тогда
		// Заполнение шапки
		Заказ = ДанныеЗаполнения.ЗаказОснование;
		Для Каждого ТекСтрокаТЧ1 Из ДанныеЗаполнения.ТЧ1 Цикл
			НоваяСтрока = ТЧ1.Добавить();
			НоваяСтрока.Клиент = ТекСтрокаТЧ1.Клиент;
			НоваяСтрока.Количество = ТекСтрокаТЧ1.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТЧ1.Номенклатура;
			НоваяСтрока.Стоимость = ТекСтрокаТЧ1.Стоимость;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Для Каждого Стр из ТЧ1 Цикл 
		Запись = РегистрыСведений.ЗанятостьТранспорта.СоздатьМенеджерЗаписи();
		Запись.Транспорт = Стр.Автомобиль;
		Запись.Статус = Перечисления.СтатусТранспорта.Занят;
		Запись.Записать();
	КонецЦикла;
КонецПроцедуры
