
&НаКлиенте
Процедура ТЧ1АвтомобильПриИзменении(Элемент)
	ТекСтрока = Элементы.ТЧ1.ТекущиеДанные;
	Авто = ТекСтрока.Автомобиль;
	
	Если ПроверитьАвто(Авто) Тогда 
		Сообщить("Автомобиль "+Авто+" уже занят");
		ТекСтрока.Автомобиль = Неопределено;
		Возврат;
	КонецЕсли; 
	ТекСтрока.Водитель = НайтиАвтоИлиВодителя(Авто);	
КонецПроцедуры    

Функция ПроверитьАвто(Транспорт)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗанятостьТранспорта.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.ЗанятостьТранспорта КАК ЗанятостьТранспорта
		|ГДЕ
		|	ЗанятостьТранспорта.Транспорт = &Транспорт";
	
	Запрос.УстановитьПараметр("Транспорт", Транспорт);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Если ВыборкаДетальныеЗаписи.Статус = Перечисления.СтатусТранспорта.Занят Тогда 
			Возврат Ложь;
		Иначе 
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь
КонецФункции

&НаКлиенте
Процедура ТЧ1ВодительПриИзменении(Элемент)
	ТекСтрока = Элементы.ТЧ1.ТекущиеДанные;
	ТекСтрока.Автомобиль = НайтиАвтоИлиВодителя(ТекСтрока.Водитель);
	
КонецПроцедуры

Функция НайтиАвтоИлиВодителя(Парам)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗакреплениеТрансорта.Водитель КАК Водитель,
		|	ЗакреплениеТрансорта.Транспорт КАК Транспорт
		|ИЗ
		|	РегистрСведений.ЗакреплениеТрансорта КАК ЗакреплениеТрансорта";
	
	Если ТипЗнч(Парам) = тип("СправочникСсылка.Сотрудники") Тогда 
		Запрос.Текст = Запрос.Текст +Символы.ПС+"ГДЕ
									  |	ЗакреплениеТрансорта.Водитель = &Водитель";
	Запрос.УстановитьПараметр("Водитель", Парам);	
	ИначеЕсли ТипЗнч(Парам) = тип("СправочникСсылка.Транспорт") Тогда
		Запрос.Текст = Запрос.Текст +Символы.ПС+"ГДЕ
		 							  |ЗакреплениеТрансорта.Транспорт = &Транспорт";
	Запрос.УстановитьПараметр("Транспорт", Парам);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ТипЗнч(Парам) = тип("СправочникСсылка.Сотрудники") Тогда
			Возврат ВыборкаДетальныеЗаписи.Транспорт;
		ИначеЕсли ТипЗнч(Парам) = тип("СправочникСсылка.Транспорт") Тогда
			Возврат ВыборкаДетальныеЗаписи.Водитель;
		КонецЕсли;
	КонецЦикла;
КонецФункции
