
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИзмеренияПланировщика   = Планировщик.Измерения;
    ИзмеренияПланировщика.Очистить();
	
	ЭлементыПланировщика = Планировщик.Элементы;
    ЭлементыПланировщика.Очистить();
	
	Измерениеводит       = ИзмеренияПланировщика.Добавить("Транспорт");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Транспорт.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Транспорт КАК Транспорт";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовыйТранспорт = Измерениеводит.Элементы.Добавить(ВыборкаДетальныеЗаписи.Наименование);
		НовыйТранспорт.Текст = ВыборкаДетальныеЗаписи.Наименование;
	КонецЦикла;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаршрутныйЛистТЧ1.Водитель КАК Водитель,
		|	МаршрутныйЛистТЧ1.ДатаДоставки КАК ДатаДоставки,
		|	МаршрутныйЛистТЧ1.Ссылка.Дата КАК Дата
		|ИЗ
		|	Документ.МаршрутныйЛист.ТЧ1 КАК МаршрутныйЛистТЧ1";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СоответствиеЗначений = Новый Соответствие;
        СоответствиеЗначений.Вставить("Водитель",Строка(ВыборкаДетальныеЗаписи.Водитель));

		Начало  = ВыборкаДетальныеЗаписи.Дата;
        Конец   = ВыборкаДетальныеЗаписи.ДатаДоставки;

        // Добавление новой записи в промежуток времени
        НовыйЭлемент = ЭлементыПланировщика.Добавить(Начало, Конец);
        НовыйЭлемент.ЗначенияИзмерений  = Новый ФиксированноеСоответствие(СоответствиеЗначений);
        НовыйЭлемент.Текст              = Строка(ВыборкаДетальныеЗаписи.Водитель);
	КонецЦикла;
	
КонецПроцедуры
