
&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("АдресКартинкиНажатиеЗавершение", ЭтотОбъект); 
	
	НачатьПомещениефайла(Оповещение,,,Истина, УникальныйИдентификатор); 
	
	СтандартнаяОбработка = Ложь;
	
	
	КонецПроцедуры
	
	
	&НаКлиенте
	Процедура АдресКартинкиНажатиеЗавершение(Результат,Адрес, ПомещаемыйФайл, ДополнительныеПараметры) Экспорт
		
		Если НЕ Результат Тогда
			Возврат ;
		КонецЕсли;	
		
		АдресКартинки = Адрес;
		
		Модифицированность = Истина;
	
	КонецПроцедуры
	
	&НаСервере
	Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
		Если ЭтоАдресВременногоХранилища (АдресКартинки) Тогда
			
			ТекущийОбъект.Изображение = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресКартинки));
		КонецЕсли;	

	КонецПроцедуры
	
	&НаСервере
	Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		АдресКартинки = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Изображение");
	КонецПроцедуры

