
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если Выполнен Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаршрутныйЛистТЧ1.Автомобиль КАК Автомобиль
		|ИЗ
		|	Документ.Заказ КАК Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛист.ТЧ1 КАК МаршрутныйЛистТЧ1
		|		ПО Заказ.Ссылка = МаршрутныйЛистТЧ1.Ссылка.Заказ
		|ГДЕ
		|	Заказ.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Запись = РегистрыСведений.ЗанятостьТранспорта.СоздатьМенеджерЗаписи();
			Запись.Транспорт = ВыборкаДетальныеЗаписи.Автомобиль;
			Запись.Статус = Перечисления.СтатусТранспорта.Свободен;
			Запись.Записать();
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры
